app/serializers/hero_serializer.rb

SELECT "powers".* FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = ?  [["hero_id", 81]]
---
  def powers
    object.powers.map do |power|