app/serializers/power_serializer.rb

SELECT "heros".* FROM "heros" INNER JOIN "hero_powers" ON "heros"."id" = "hero_powers"."hero_id" WHERE "hero_powers"."power_id" = ?  [["power_id", 1]]
---
  def heroes
    object.heroes.map do |hero|