app/controllers/heroes_controller.rb

  def index
    heroes = Hero.all.map { |hero| { id: hero.id, name: hero.name, super_name: hero.super_name } }
---
SELECT "heros".* FROM "heros"

  def show
    hero = Hero.includes(:powers).find_by(id: params[:id])
    if hero
      hero_data = { id: hero.id, name: hero.name, super_name: hero.super_name, powers: hero.powers.map { |power| { id: power.id, name: power.name, description: power.description } } }
---
SELECT "powers".* FROM "powers" INNER JOIN "hero_powers" ON "powers"."id" = "hero_powers"."power_id" WHERE "hero_powers"."hero_id" = ?  [["hero_id", 81]]
SELECT "heros".* FROM "heros"