app/controllers/powers_controller.rb

  def index
    powers = Power.all
---
SELECT "powers".* FROM "powers"

  def show
    power = Power.find_by(id: params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]